src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРеализации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЦены(ОбновляемыеТовары, Дата, НаименованиеВидаЦены, ДанныеОтбора = Неопределено) Экспорт
	Цены = Новый Массив();
	
	Если ДанныеОтбора = Неопределено Тогда
		ДанныеОтбора = Новый Структура()
	КонецЕсли;
	НужныйВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(НаименованиеВидаЦены);
	ДанныеОтбора.Вставить("ВидЦены", НужныйВидЦены);	
	
	ДанныеРегистра = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(Дата,ДанныеОтбора);
	
	Для Каждого Строка Из ОбновляемыеТовары Цикл
		Если ТипЗнч(Строка) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Товар = Строка.Номенклатура;
		Иначе
			Товар = Строка;
		КонецЕсли;
		Строка = ДанныеРегистра.Найти(Товар, "Номенклатура");
		Если Строка <> Неопределено  Тогда
			Цены.Добавить(Строка.Цена);
		Иначе
			Цены.Добавить(0);
		КонецЕсли;
	КонецЦикла;
	Возврат Цены;
КонецФункции

&НаСервереБезКонтекста
Функция ВидЦеныИзСклада(СкладСсылка) Экспорт
	Если ЗначениеЗаполнено(СкладСсылка) Тогда
		Склад = СкладСсылка.ПолучитьОбъект();
		Если СтрЗаканчиваетсяНа(Склад.Наименование,"ый") Тогда 
			НаименованиеВидаЦены = Лев(Склад.Наименование, СтрДлина(Склад.Наименование)-2);
			НаименованиеВидаЦены = НаименованиеВидаЦены + "ая";
		Иначе
			НаименованиеВидаЦены = "Розничная";
		КонецЕсли;
	Иначе
		НаименованиеВидаЦены = "Розничная";
	КонецЕсли;
	Возврат НаименованиеВидаЦены;
КонецФункции

&НаКлиенте
Процедура ОбновитьЦеныТоваров()
	Товары = Объект.Товары;
	Цены   = ПолучитьЦены(Товары, Объект.Дата, ВидЦеныИзСклада(Объект.Склад));
	Индекс = 0;
	Для Каждого Товар Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Товар.Номенклатура) Тогда
			Товар.ЦенаРеализации = Цены[Индекс];
			Товар.Стоимость      = Товар.Количество * Товар.ЦенаРеализации;
		КонецЕсли;
		Индекс = Индекс+1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	ОбновляемыеТовары = Новый Массив();
	ОбновляемыеТовары.Добавить(Товар.Номенклатура);
	ДанныеОтбора = Новый Структура();
	ДанныеОтбора.Вставить("Номенклатура", Товар.Номенклатура);
	
	Цены = ПолучитьЦены(ОбновляемыеТовары, Объект.Дата, ВидЦеныИзСклада(Объект.Склад), ДанныеОтбора);
	
	Товар.ЦенаРеализации = Цены[0];
	Товар.Стоимость      = Товар.Количество*Товар.ЦенаРеализации;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.Стоимость = Товар.Количество * Товар.ЦенаРеализации;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьЦеныТоваров();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьЦеныТоваров();
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорПоУмолчаниюНаСервере(Контрагент) Экспорт
	Возврат РасчетыКлиентСервер.ПолучитьДоговорПоУмолчаниюНаСервере(Контрагент);
КонецФункции

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	Объект.Договор = ПолучитьДоговорПоУмолчаниюНаСервере(Объект.Покупатель);
КонецПроцедуры
